<!-- dflook/terraform-github-actions {"workspace":"dev","backend_type":"s3","label":"dev","backend":"22e24807f1bbd1bf0c2ce19ec0de33d3f656915d7b2ecaa032db491d6a4c69ce","plan_job_ref":"Job CICD for Splitrr Infra #45 at https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10676633774","plan_out_hash":"d23fe4aec8b68acb55e8acd780f2d295613e9075c30955ce3950d4d3e8d8140f","plan_hash":"098999280d1afabbcdd82df9bd632e84ab55ba477c53f2b2ce81113912ff1f79","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 2 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.app_route53_record.aws_route53_record.site_domain will be created
+   resource "aws_route53_record" "site_domain" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "app"
+       type            = "CNAME"
+       zone_id         = "*********************"

+       alias {
+           evaluate_target_health = true
+           name                   = "d2kv2y9eh8mtkp.cloudfront.net"
+           zone_id                = "**************"
        }
    }

  # module.ecs-ec2.aws_ecs_service.app will be updated in-place
!~  resource "aws_ecs_service" "app" {
        id                                 = "arn:aws:ecs:us-east-1:949263681218:service/EC2-ECS-CLUSTER/splitrr-dev-backend-ecs-ec2-service"
        name                               = "splitrr-dev-backend-ecs-ec2-service"
        tags                               = {
            "Name" = "splitrr-dev-backend-ecs-ec2-service"
        }
!~      task_definition                    = "arn:aws:ecs:us-east-1:949263681218:task-definition/splitrr-dev-backend-ecs-ec2-task-def:2" -> (known after apply)
#        (16 unchanged attributes hidden)

#        (6 unchanged blocks hidden)
    }

  # module.ecs-ec2.aws_ecs_task_definition.app must be replaced
-/+ resource "aws_ecs_task_definition" "app" {
!~      arn                      = "arn:aws:ecs:us-east-1:949263681218:task-definition/splitrr-dev-backend-ecs-ec2-task-def:2" -> (known after apply)
!~      arn_without_revision     = "arn:aws:ecs:us-east-1:949263681218:task-definition/splitrr-dev-backend-ecs-ec2-task-def" -> (known after apply)
!~      container_definitions    = jsonencode(
!~          [
!~              {
-                   mountPoints      = []
                    name             = "splitrr-dev-backend-ecs-ec2-container"
!~                  portMappings     = [
!~                      {
-                           protocol      = "tcp"
#                            (2 unchanged attributes hidden)
                        },
                    ]
-                   systemControls   = []
-                   volumesFrom      = []
#                    (5 unchanged attributes hidden)
                },
            ]
        )
!~      id                       = "************************************" -> (known after apply)
!~      memory                   = "700" -> "701" # forces replacement
!~      revision                 = 2 -> (known after apply)
        tags                     = {
            "Name" = "splitrr-dev-backend-ecs-ec2-task-def"
        }
#        (11 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [CICD for Splitrr Infra #45](https://github.com/bibek65/Splitrr-Infrastructure/actions/runs/10676633774)